In [2]:
import pandas as pd
import numpy as np

In [4]:
# Sample DataFrame
data = {
    'Date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02', '2024-01-03'],
    'City': ['Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Chennai'],
    'Product': ['A', 'B', 'A', 'C', 'B'],
    'Sales': [100, 150, 120, 200, 180],
    'Quantity': [10, 15, 12, 20, 18]
}
df = pd.DataFrame(data)

In [8]:
df

         Date     City Product  Sales  Quantity
0  2024-01-01   Mumbai       A    100        10
1  2024-01-01    Delhi       B    150        15
2  2024-01-02   Mumbai       A    120        12
3  2024-01-02    Delhi       C    200        20
4  2024-01-03  Chennai       B    180        18

In [10]:
print("Original DataFrame:")
print(df)
print("-" * 30)

Original DataFrame:
         Date     City Product  Sales  Quantity
0  2024-01-01   Mumbai       A    100        10
1  2024-01-01    Delhi       B    150        15
2  2024-01-02   Mumbai       A    120        12
3  2024-01-02    Delhi       C    200        20
4  2024-01-03  Chennai       B    180        18
------------------------------

##### 1. Wide to Long Format (without aggregation)

In [13]:
df_pivot_example = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02'],
    'City': ['Mumbai', 'Delhi', 'Mumbai', 'Delhi'],
    'Temperature': [28, 20, 29, 21]
})
print("DataFrame for pivot() example:")
print(df_pivot_example)
print("-" * 30)

DataFrame for pivot() example:
         Date    City  Temperature
0  2024-01-01  Mumbai           28
1  2024-01-01   Delhi           20
2  2024-01-02  Mumbai           29
3  2024-01-02   Delhi           21
------------------------------

In [15]:
pivoted_df = df_pivot_example.pivot(index='Date', columns='City', values='Temperature')
print("1. Using pivot():")
print(pivoted_df)
print("-" * 30)

1. Using pivot():
City        Delhi  Mumbai
Date
2024-01-01     20      28
2024-01-02     21      29
------------------------------

##### 2. Wide to Long Format (with aggregation)

In [23]:
# Example 1: Basic pivot table - Sum of Sales by City and Product
 
pivot_table_basic = pd.pivot_table(df, values='Sales', index='City', columns='Product', aggfunc='sum')
print("2. Using pivot_table() (Basic - sum of Sales):")
print(pivot_table_basic)
print("-" * 30)

2. Using pivot_table() (Basic - sum of Sales):
Product      A      B      C
City
Chennai    NaN  180.0    NaN
Delhi      NaN  150.0  200.0
Mumbai   220.0    NaN    NaN
------------------------------

In [25]:
# Example 2: Multiple values and aggregation functions
pivot_table_multi_agg = pd.pivot_table(df,
                                       values=['Sales', 'Quantity'],
                                       index=['Date', 'City'],
                                       columns='Product',
                                       aggfunc={'Sales': 'sum', 'Quantity': 'mean'})
print("2. Using pivot_table() (Multiple aggregations):")
print(pivot_table_multi_agg)
print("-" * 30)

2. Using pivot_table() (Multiple aggregations):
                   Quantity              Sales
Product                   A     B     C      A      B      C
Date       City
2024-01-01 Delhi        NaN  15.0   NaN    NaN  150.0    NaN
           Mumbai      10.0   NaN   NaN  100.0    NaN    NaN
2024-01-02 Delhi        NaN   NaN  20.0    NaN    NaN  200.0
           Mumbai      12.0   NaN   NaN  120.0    NaN    NaN
2024-01-03 Chennai      NaN  18.0   NaN    NaN  180.0    NaN
------------------------------

In [27]:
pivot_table_multi_agg

                   Quantity              Sales
Product                   A     B     C      A      B      C
Date       City
2024-01-01 Delhi        NaN  15.0   NaN    NaN  150.0    NaN
           Mumbai      10.0   NaN   NaN  100.0    NaN    NaN
2024-01-02 Delhi        NaN   NaN  20.0    NaN    NaN  200.0
           Mumbai      12.0   NaN   NaN  120.0    NaN    NaN
2024-01-03 Chennai      NaN  18.0   NaN    NaN  180.0    NaN

In [37]:
# Example 3: Adding margins (totals)

pivot_table_margins = pd.pivot_table(df, values='Sales', index='City', columns='Product', aggfunc='sum', margins=True, margins_name='Total')
print("2. Using pivot_table() (With margins/totals):")
print(pivot_table_margins)
print("-" * 30)

2. Using pivot_table() (With margins/totals):
Product      A      B      C  Total
City
Chennai    NaN  180.0    NaN    180
Delhi      NaN  150.0  200.0    350
Mumbai   220.0    NaN    NaN    220
Total    220.0  330.0  200.0    750
------------------------------

In [33]:
pivot_table_margins

Product      A      B      C  Total
City
Chennai    NaN  180.0    NaN    180
Delhi      NaN  150.0  200.0    350
Mumbai   220.0    NaN    NaN    220
Total    220.0  330.0  200.0    750

##### 3. melt(): Long to Wide Format

In [40]:
# Example 1: Basic melt

wide_df = pd.DataFrame({
    'Year': [2023, 2024],
    'Q1_Sales': [1000, 1200],
    'Q2_Sales': [1100, 1300],
    'Q3_Sales': [1050, 1250],
    'Q4_Sales': [1150, 1350]
})
print("DataFrame for melt() example (Wide format):")
print(wide_df)
print("-" * 30)

DataFrame for melt() example (Wide format):
   Year  Q1_Sales  Q2_Sales  Q3_Sales  Q4_Sales
0  2023      1000      1100      1050      1150
1  2024      1200      1300      1250      1350
------------------------------

In [42]:
wide_df

   Year  Q1_Sales  Q2_Sales  Q3_Sales  Q4_Sales
0  2023      1000      1100      1050      1150
1  2024      1200      1300      1250      1350

In [75]:
# stack() - Columns to rows
stacked_wide_df = wide_df.stack(future_stack=True)

In [77]:
stacked_wide_df

0  Year        2023
   Q1_Sales    1000
   Q2_Sales    1100
   Q3_Sales    1050
   Q4_Sales    1150
1  Year        2024
   Q1_Sales    1200
   Q2_Sales    1300
   Q3_Sales    1250
   Q4_Sales    1350
dtype: int64

In [44]:
melted_df = pd.melt(wide_df,
                    id_vars=['Year'],
                    value_vars=['Q1_Sales', 'Q2_Sales', 'Q3_Sales', 'Q4_Sales'],
                    var_name='Quarter',
                    value_name='Sales')
print("3. Using melt() (Basic):")
print(melted_df)
print("-" * 30)

3. Using melt() (Basic):
   Year   Quarter  Sales
0  2023  Q1_Sales   1000
1  2024  Q1_Sales   1200
2  2023  Q2_Sales   1100
3  2024  Q2_Sales   1300
4  2023  Q3_Sales   1050
5  2024  Q3_Sales   1250
6  2023  Q4_Sales   1150
7  2024  Q4_Sales   1350
------------------------------

In [46]:
melted_df

   Year   Quarter  Sales
0  2023  Q1_Sales   1000
1  2024  Q1_Sales   1200
2  2023  Q2_Sales   1100
3  2024  Q2_Sales   1300
4  2023  Q3_Sales   1050
5  2024  Q3_Sales   1250
6  2023  Q4_Sales   1150
7  2024  Q4_Sales   1350

In [48]:
# Example 2: Melting all non-id_vars columns

melted_all = pd.melt(wide_df, id_vars=['Year'], var_name='Quarter', value_name='Sales')
print("3. Using melt() (Melting all non-id_vars):")
print(melted_all)
print("-" * 30)

3. Using melt() (Melting all non-id_vars):
   Year   Quarter  Sales
0  2023  Q1_Sales   1000
1  2024  Q1_Sales   1200
2  2023  Q2_Sales   1100
3  2024  Q2_Sales   1300
4  2023  Q3_Sales   1050
5  2024  Q3_Sales   1250
6  2023  Q4_Sales   1150
7  2024  Q4_Sales   1350
------------------------------

In [50]:
melted_all

   Year   Quarter  Sales
0  2023  Q1_Sales   1000
1  2024  Q1_Sales   1200
2  2023  Q2_Sales   1100
3  2024  Q2_Sales   1300
4  2023  Q3_Sales   1050
5  2024  Q3_Sales   1250
6  2023  Q4_Sales   1150
7  2024  Q4_Sales   1350

##### 4.stack() and unstack(): Working with MultiIndex

In [55]:
# Example 1: stack() - Columns to rows

# Use the pivot_table_multi_agg from above, which has a MultiIndex on columns
print("DataFrame before stack():")
print(pivot_table_multi_agg)
print("-" * 30)

DataFrame before stack():
                   Quantity              Sales
Product                   A     B     C      A      B      C
Date       City
2024-01-01 Delhi        NaN  15.0   NaN    NaN  150.0    NaN
           Mumbai      10.0   NaN   NaN  100.0    NaN    NaN
2024-01-02 Delhi        NaN   NaN  20.0    NaN    NaN  200.0
           Mumbai      12.0   NaN   NaN  120.0    NaN    NaN
2024-01-03 Chennai      NaN  18.0   NaN    NaN  180.0    NaN
------------------------------

In [59]:
stacked_df = pivot_table_multi_agg.stack(future_stack=True)
print("4. Using stack():")
print(stacked_df)
print("-" * 30)

4. Using stack():
                            Quantity  Sales
Date       City    Product
2024-01-01 Delhi   A             NaN    NaN
                   B            15.0  150.0
                   C             NaN    NaN
           Mumbai  A            10.0  100.0
                   B             NaN    NaN
                   C             NaN    NaN
2024-01-02 Delhi   A             NaN    NaN
                   B             NaN    NaN
                   C            20.0  200.0
           Mumbai  A            12.0  120.0
                   B             NaN    NaN
                   C             NaN    NaN
2024-01-03 Chennai A             NaN    NaN
                   B            18.0  180.0
                   C             NaN    NaN
------------------------------

In [61]:
stacked_df

                            Quantity  Sales
Date       City    Product
2024-01-01 Delhi   A             NaN    NaN
                   B            15.0  150.0
                   C             NaN    NaN
           Mumbai  A            10.0  100.0
                   B             NaN    NaN
                   C             NaN    NaN
2024-01-02 Delhi   A             NaN    NaN
                   B             NaN    NaN
                   C            20.0  200.0
           Mumbai  A            12.0  120.0
                   B             NaN    NaN
                   C             NaN    NaN
2024-01-03 Chennai A             NaN    NaN
                   B            18.0  180.0
                   C             NaN    NaN

In [79]:
# Example 2: unstack() - Rows to columns

# create a DataFrame with MultiIndex on rows
df_multi_index_row = df.set_index(['Date', 'City', 'Product'])['Sales'].unstack()
print("DataFrame before unstack() (MultiIndex on columns):")
print(df_multi_index_row)
print("-" * 30)

DataFrame before unstack() (MultiIndex on columns):
Product                 A      B      C
Date       City
2024-01-01 Delhi      NaN  150.0    NaN
           Mumbai   100.0    NaN    NaN
2024-01-02 Delhi      NaN    NaN  200.0
           Mumbai   120.0    NaN    NaN
2024-01-03 Chennai    NaN  180.0    NaN
------------------------------

In [81]:
df_multi_index_row

Product                 A      B      C
Date       City
2024-01-01 Delhi      NaN  150.0    NaN
           Mumbai   100.0    NaN    NaN
2024-01-02 Delhi      NaN    NaN  200.0
           Mumbai   120.0    NaN    NaN
2024-01-03 Chennai    NaN  180.0    NaN

In [83]:
unstacked_df = df_multi_index_row.unstack(level='City') # Unstack 'City' level from the row index
print("4. Using unstack():")
print(unstacked_df)
print("-" * 30)

4. Using unstack():
Product          A                    B                     C
City       Chennai Delhi Mumbai Chennai  Delhi Mumbai Chennai  Delhi Mumbai
Date
2024-01-01     NaN   NaN  100.0     NaN  150.0    NaN     NaN    NaN    NaN
2024-01-02     NaN   NaN  120.0     NaN    NaN    NaN     NaN  200.0    NaN
2024-01-03     NaN   NaN    NaN   180.0    NaN    NaN     NaN    NaN    NaN
------------------------------

In [85]:
unstacked_df

Product          A                    B                     C
City       Chennai Delhi Mumbai Chennai  Delhi Mumbai Chennai  Delhi Mumbai
Date
2024-01-01     NaN   NaN  100.0     NaN  150.0    NaN     NaN    NaN    NaN
2024-01-02     NaN   NaN  120.0     NaN    NaN    NaN     NaN  200.0    NaN
2024-01-03     NaN   NaN    NaN   180.0    NaN    NaN     NaN    NaN    NaN